# Chloe's Pandas HW

In [692]:
# You must include a written description of three observable trends based on the data.
# Of the 780 players sampled, the top age range was 21-24 (266 players) followed by 17-20.  
# There is roughly a 1:5.77 Female to Male ratio of players sampled (15 non disclosed)
# The most profitable and most bought item was ItemID 178 with a Total Purchase Price of $50.76 and 12 sales.

In [693]:
#upload file
import pandas as pd
import numpy as np
import csv

file = 'purchase_data.csv'
#file = '⁨Users⁩/chlliu⁩/lpthw⁩/Bootcamp⁩/Pandas⁩/04-Pandas⁩/Homework⁩/HeroesOfPymoli⁩/Resources/purchase_data.csv'
df_orig = pd.read_csv(file)

df_orig.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

# PLAYER COUNT ##

In [694]:
total_players = df_orig['Purchase ID'].count()
df_Player_Count = {"Total Players" : [total_players]}
df_Player_Count

{'Total Players': [780]}

# Purchasing Analysis (Total)

In [695]:
#Number of Unique Items
unique_items = df_orig.groupby(['Item ID'])
No_unique_items = unique_items['Item ID'].count()
total_rows = No_unique_items.shape[0]
total_rows

183

In [696]:
# Average Purchase Price
avg_price = df_orig['Price'].mean()
avg_price

3.050987179487176

In [697]:
# Total Number of Purchases
total_purch = df_orig['Item ID'].count()
total_purch

780

In [698]:
# Total Revenue
total_rev = df_orig['Price'].sum()
total_rev

2379.77

In [699]:
#### ANSWER DATA FRAME ####
df_purch_analysis = {"Unique Items": [total_rows], "Avg Price": [avg_price], "No. Purchases": [total_purch], "Total Revenue": [total_rev]}
df_purch_analysis

{'Unique Items': [183],
 'Avg Price': [3.050987179487176],
 'No. Purchases': [780],
 'Total Revenue': [2379.77]}

# Gender Demographics

In [700]:
# Percentage and Count of Male Players
# Percentage and Count of Female Players
# Percentage and Count of Other / Non-Disclosed
df_gender = df_orig.groupby('Gender').count()
df_gender_count =  pd.DataFrame({"Count": df_gender["Purchase ID"]})
df_gender_count

                       Count
Gender
Female                   113
Male                     652
Other / Non-Disclosed     15

In [701]:
df_gender_total_count = df_gender_count['Count'].sum()
df_gender_total_count
df_percent = df_gender_count['Count']/df_gender_total_count
df_percent

Gender
Female                   0.144872
Male                     0.835897
Other / Non-Disclosed    0.019231
Name: Count, dtype: float64

In [702]:
#### GENDER ANSWER ####
Df_gender_answer =  pd.merge(df_gender_count, df_percent, on='Gender', how='outer')
#Df_gender_answer
Df_gender_answer2 = Df_gender_answer.rename(columns={'Count_x': 'Count', 'Count_y': 'Percent'})
Df_gender_answer2

                       Count   Percent
Gender
Female                   113  0.144872
Male                     652  0.835897
Other / Non-Disclosed     15  0.019231

# ### Age Demographics

In [703]:
# The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
max_age = df_orig.Age.max()

# Create the bins in which Data will be held
age_year = np.arange(0,50, 4)
bins = age_year

# Create the names for the four bins
group_names = ["0-4", "5-8", "9-12", "13-16", "17-20", "21-24", "25-28", "29-32", "33-36", "37-40", "41-44", "45-48"]
df_orig["Age Group"] = pd.cut(df_orig["Age"], bins, labels= group_names)
df_orig.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,17-20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,37-40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21-24
4,4,Iskosia90,23,Male,131,Fury,1.44,21-24

In [704]:
# Purchase Count
df_Age_Group = df_orig
df_Age_Group_purchase_count = df_Age_Group.groupby(['Age Group'])['Price'].count()
df_Age_Group_purchase_count

Age Group
0-4        0
5-8       17
9-12      28
13-16     71
17-20    170
21-24    266
25-28     88
29-32     63
33-36     42
37-40     28
41-44      6
45-48      1
Name: Price, dtype: int64

In [705]:
# Average Purchase Price
df_Age_Group_purchase_sum = df_Age_Group.groupby(['Age Group'])['Price'].sum()
df_Age_Group_purchase_sum

Age Group
0-4        0.00
5-8       58.86
9-12      84.69
13-16    212.57
17-20    531.00
21-24    799.74
25-28    257.77
29-32    192.29
33-36    121.63
37-40     99.69
41-44     19.83
45-48      1.70
Name: Price, dtype: float64

In [706]:
# Total Purchase Value
# Average Purchase Total per Person by Age Group

Df_age_merge =  pd.merge(df_Age_Group_purchase_sum, df_Age_Group_purchase_count, on='Age Group', how='outer')
Df_age_merge.columns = ['Price Sum', 'Price Count']


Df_age_merge['Price Avg'] = Df_age_merge['Price Sum']/Df_age_merge['Price Count']
Df_age_merge

           Price Sum  Price Count  Price Avg
Age Group
0-4             0.00            0        NaN
5-8            58.86           17   3.462353
9-12           84.69           28   3.024643
13-16         212.57           71   2.993944
17-20         531.00          170   3.123529
21-24         799.74          266   3.006541
25-28         257.77           88   2.929205
29-32         192.29           63   3.052222
33-36         121.63           42   2.895952
37-40          99.69           28   3.560357
41-44          19.83            6   3.305000
45-48           1.70            1   1.700000

# Top Spenders

In [707]:
# Identify the the top 5 spenders in the game by total purchase value, 
df_orig_spend = df_orig.groupby(['SN'])['Price'].sum()
df_orig_spend2 =pd.DataFrame(df_orig_spend )
df_orig_spend2
df_orig_spendAcend = df_orig_spend2.sort_values('Price', ascending = False)
TopSpenders = df_orig_spendAcend.head(5)
TopSpenders

             Price
SN
Lisosia93    18.96
Idastidru52  15.45
Chamjask73   13.83
Iral74       13.62
Iskadarya95  13.10

In [708]:
#then list (in a table):
  # SN    -> TopSpender
  # Purchase Count -> need to count ID on orig table and left merger on Top Spenders
  # Average Purchase Price -> Price from Top Spenders /Count
  # Total Purchase Value -> Top Spenders

#Master Count DF
ID_Count = df_orig.groupby(['SN']).count()
ID_Count_2 = ID_Count[['Purchase ID']]
ID_Count_2DF = ID_Count_2.rename(columns={'Purchase ID':'Purchase Count'})
ID_Count_2DF

#Merge Top Spender with Master Count left
Df_Top5_Merge =  pd.merge(TopSpenders, ID_Count_2DF, on='SN', how='left')
Df_Top5_Merge2 = Df_Top5_Merge.rename(columns={'Price':'Total Price'})

#Avg Price ColoumnDf_Top5_Merge2['Total Price']
Df_Top5_Merge2['Avg Price'] = pd.DataFrame(Df_Top5_Merge2['Total Price']/Df_Top5_Merge2['Purchase Count'])

#### TOP SPENDERS ANSWER ####
Df_Top5_Merge2

             Total Price  Purchase Count  Avg Price
SN
Lisosia93          18.96               5   3.792000
Idastidru52        15.45               4   3.862500
Chamjask73         13.83               3   4.610000
Iral74             13.62               4   3.405000
Iskadarya95        13.10               3   4.366667

# ### Most Popular Items

In [709]:
#DF Item ID Count Master Table
df_Item_Group = df_orig.groupby(['Item ID']).count()
df_Item_Group2 = df_Item_Group[['Purchase ID']]
df_Item_Group3 = df_Item_Group2.rename(columns={'Purchase ID':'Item Count'})
df_Item_Group3


#Sort DF Item ID Count Master Table From Most Popular to Least
df_PopItemAcend = df_Item_Group3.sort_values('Item Count', ascending = False)

#Top 5 Items 
df_PopItem_5 = df_PopItemAcend.head(5)
df_PopItem_5

         Item Count
Item ID
178              12
145               9
108               9
82                9
19                8

In [710]:
##Item ID
  # Item Name - get from master list
  # Purchase Count - in DF
  # Item Price - get from master
  # Total Purchase Value - ???

df_LookUp = df_orig[['Item ID', 'Item Name', 'Price']]
df_LookUpMaster = df_LookUp.rename(columns={'Price': 'Item Price'})
df_LookUpMaster.head()

   Item ID                                  Item Name  Item Price
0      108  Extraction, Quickblade Of Trembling Hands        3.53
1      143                          Frenzied Scimitar        1.56
2       92                               Final Critic        4.88
3      100                                Blindscythe        3.27
4      131                                       Fury        1.44

In [711]:
#Merge
Df_Top5_ItemMerge =  pd.merge(df_PopItem_5, df_LookUpMaster, on='Item ID', how='left')
Df_Top5_ItemMaster = Df_Top5_ItemMerge.drop_duplicates()

#Calclate and add Purchase Value
Df_Top5_ItemMaster['Total Purchase Value'] = Df_Top5_ItemMaster['Item Count']*Df_Top5_ItemMaster['Item Price']

#### MOST POPULAR ITEM ANSWER ####
Df_Top5_ItemMaster

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Item ID,Item Count,Item Name,Item Price,Total Purchase Value
0,178,12,"Oathbreaker, Last Hope of the Breaking Storm",4.23,50.76
12,145,9,Fiery Glass Crusader,4.58,41.22
21,108,9,"Extraction, Quickblade Of Trembling Hands",3.53,31.77
30,82,9,Nirvana,4.90,44.10
39,19,8,"Pursuit, Cudgel of Necromancy",1.02,8.16

# Most Profitable Items

In [712]:
# Identify the 5 most profitable items by total purchase value, then list (in a table):
  # Item ID - in
  # Item Name - add
  # Purchase Count - in
  # Item Price - add
  # Total Purchase Value - calc

In [713]:
#Master Count of Items
df_Item_Group3.head()

         Item Count
Item ID
0                 4
1                 3
2                 6
3                 6
4                 5

In [714]:
#Add column Price and item name
Df_Profit_Lookup = df_orig[['Item ID', 'Item Name', 'Price']]

#Merge Master Count and Lookup DF
Df_MasterMerge =  pd.merge(df_Item_Group3, Df_Profit_Lookup, on='Item ID', how='outer')
Df_MasterMerge2 = Df_MasterMerge.drop_duplicates(subset='Item ID', keep='first', inplace=False)

Df_MasterMerge2.head()

    Item ID  Item Count           Item Name  Price
0         0           4            Splinter   1.28
4         1           3            Crucifer   3.26
7         2           6             Verdict   2.48
13        3           6        Phantomlight   2.49
19        4           5  Bloodlord's Fetish   1.70

In [715]:
#Add total price
Df_MasterMerge2['Total Purchase Price'] = Df_MasterMerge2['Item Count']* Df_MasterMerge2['Price']
Df_MasterMergeAcend = Df_MasterMerge2.sort_values('Total Purchase Price', ascending = False)

#Top 5
DF_TopProf_5 = Df_MasterMergeAcend.head(5)
DF_TopProf_5

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Item ID,Item Count,Item Name,Price,Total Purchase Price
750,178,12,"Oathbreaker, Last Hope of the Breaking Storm",4.23,50.76
340,82,9,Nirvana,4.90,44.10
613,145,9,Fiery Glass Crusader,4.58,41.22
381,92,8,Final Critic,4.88,39.04
436,103,8,Singed Scalpel,4.35,34.80

#